In [1]:
# Series 연산
from pandas import Series

s1 = Series([10, 15, 20], index=['일','이','삼'])
s2 = Series([2,4,6,8], index=['일','이','삼','사'])

print(s1)
print(s2)

일    10
이    15
삼    20
dtype: int64
일    2
이    4
삼    6
사    8
dtype: int64

In [2]:
s1 + 5

일    15
이    20
삼    25
dtype: int64

In [3]:
s1 + s2

사     NaN
삼    26.0
이    19.0
일    12.0
dtype: float64

In [4]:
s3 = Series([1,2,3],index=['1줄','2줄','3줄'])

In [5]:
s1 + s3
#같은 인덱스 값이 없으니 NaN 값이 뜬다.

1줄   NaN
2줄   NaN
3줄   NaN
삼    NaN
이    NaN
일    NaN
dtype: float64

In [7]:
# DataFrame 연산

from pandas import DataFrame
import numpy as np

df1 = DataFrame(np.zeros((3,3), dtype='int32'), index=['one','two','three'])

df1 + 3 #각 요소에 3이 더해짐

       0  1  2
one    3  3  3
two    3  3  3
three  3  3  3

In [8]:
df3 = DataFrame(np.ones((4,4), dtype='int32'), index=['one','two','three','four'])
df3

       0  1  2  3
one    1  1  1  1
two    1  1  1  1
three  1  1  1  1
four   1  1  1  1

In [9]:
df3 + df1 
#같은 인덱스를 가지고 있는 값들은 연산이 됨, 인덱스가 중요, 결측치(NaN)출력

         0    1    2   3
four   NaN  NaN  NaN NaN
one    1.0  1.0  1.0 NaN
three  1.0  1.0  1.0 NaN
two    1.0  1.0  1.0 NaN

In [11]:
df3.add(df1, fill_value=0) 
# add함수의 기능 fill_value 값이 없는거에 0이 채워지니까 연산이 됨

         0    1    2    3
four   1.0  1.0  1.0  1.0
one    1.0  1.0  1.0  1.0
three  1.0  1.0  1.0  1.0
two    1.0  1.0  1.0  1.0

In [ ]:
# add() / sub()/ mul()/ div()

문자열이 있는 데이타프레임의 연산

In [12]:
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }

df = DataFrame(mydata)
df

  name  age dept
0  홍길동   22   컴공
1  박길동   33   국어
2  김길동   44   산업

In [16]:
#df + 100 ERROR

#df + str(100) ERROR

df * 3

        name  age    dept
0  홍길동홍길동홍길동   66  컴공컴공컴공
1  박길동박길동박길동   99  국어국어국어
2  김길동김길동김길동  132  산업산업산업